# -- DevOps tools
# Kubernetes
brew "kubernetes-cli"
brew "kubectx"
brew "helm"
brew "helmfile"
# Azure
brew "Azure/kubelogin/kubelogin"
brew "azure-cli"
# Flux
tap "fluxcd/tap"
brew "fluxcd/tap/flux"
# UI
brew "k9s"
cask "freelens", greedy: true
# AWS 
brew "awscli"
cask "session-manager-plugin", greedy: true
# Terraform
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/terraform-ls"
brew "terragrunt"
# Scanner
brew "trivy"

# -- General
brew "direnv"
brew "stow"
brew "jq"
brew "yq"
brew "coreutils"
brew "sops"
brew "curl"
brew "wget"
brew "git"
brew "age"
brew "go-task"
brew "btop"
brew "eza"
# -- Languages
brew "rustup"
brew "python@3.12"
brew "node"
brew "golang"
# -- Other Apps
cask "karabiner-elements", greedy: true
cask "1password-cli", greedy: true
cask "pgadmin4", greedy: true
cask "tg-pro", greedy: true
cask "nikitabobko/tap/aerospace", greedy: true
tap "FelixKratz/formulae"
brew "sketchybar"

# -- Editor
brew "tmux"
brew "neovim"
cask "ghostty", greedy: true
cask "obsidian", greedy: true
# -- Zsh plugins
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# -- Git
brew "commitizen"
brew "pre-commit"

# -- Neovim tools
brew "fzf"
brew "fd"
brew "ripgrep"
brew "lazygit"
brew "lazydocker"
brew "kubeconform"

# -- Fonts
cask "font-hack-nerd-font", greedy: true
cask "font-jetbrains-mono-nerd-font", greedy: true
cask "font-sf-pro", greedy: true
cask "sf-symbols", greedy: true

