# =============================== TAPS ===============================
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "FelixKratz/formulae"
tap "nikitabobko/tap"
tap "siderolabs/tap"
tap "mongodb/brew"

# ========================== DEVOPS & CLOUD ==========================
# Kubernetes
brew "kubernetes-cli"
brew "kubectx"
brew "helm"
brew "helmfile"
brew "k9s"
brew "cilium-cli"
brew "crane"
brew "kubelogin"

# Azure
brew "azure-cli"

# AWS
brew "awscli"
cask "session-manager-plugin", greedy: true

# Flux CD
brew "fluxcd/tap/flux"

# Talos
brew "siderolabs/tap/talosctl"
brew "siderolabs/tap/omnictl"

# Terraform
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/terraform-ls"
brew "terragrunt"

# Security & Scanning
brew "trivy"

# Container Tools
cask "freelens", greedy: true

# ========================== SYSTEM & UTILITIES =========================
brew "direnv"
brew "stow"
brew "jq"
brew "yq"
brew "coreutils"
brew "sops"
brew "curl"
brew "wget"
brew "git"
brew "age"
brew "go-task"
brew "btop"
brew "eza"
brew "rclone"
brew "unar"
brew "gnupg"
brew "gzip"

# ======================= PROGRAMMING LANGUAGES ========================
brew "rustup"
brew "python@3.12"
brew "node"
brew "golang"
brew "lua"

# ========================== APPLICATIONS ===============================
cask "karabiner-elements", greedy: true
cask "1password-cli", greedy: true
cask "1password", greedy: true
cask "pgadmin4", greedy: true
cask "tg-pro", greedy: true
cask "nikitabobko/tap/aerospace", greedy: true
cask "docker-desktop", greedy: true
cask "postman", greedy: true
cask "microsoft-azure-storage-explorer", greedy: true
cask "windows-app", greedy: true
cask "mongodb-compass", greedy: true
brew "mongosh"

# Editors & Terminal
brew "tmux"
brew "neovim"
cask "ghostty", greedy: true
cask "obsidian", greedy: true
cask "visual-studio-code", greedy: true
cask "sublime-text", greedy: true
cask "zed", greedy: true

# SketchyBar
brew "sketchybar"

# ======================= ZSH PLUGINS & SHELL =======================
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# ======================== DEVELOPMENT TOOLS =========================
# Git Tools
brew "commitizen"
brew "pre-commit"

# Editor Tools (Neovim ecosystem)
brew "fzf"
brew "fd"
brew "ripgrep"
brew "lazygit"
brew "lazydocker"
brew "kubeconform"
brew "hadolint"
brew "tree-sitter-cli"

# ============================= FONTS ===============================
cask "font-hack-nerd-font", greedy: true
cask "font-jetbrains-mono-nerd-font", greedy: true
cask "font-sf-pro", greedy: true
cask "sf-symbols", greedy: true
