# =============================== TAPS ===============================
tap "fluxcd/tap", trusted: { formula: ["flux"] }
tap "hashicorp/tap", trusted: { formula: ["terraform", "terraform-ls"] }
tap "FelixKratz/formulae", trusted: { formula: ["sketchybar"] }
tap "nikitabobko/tap", trusted: { cask: ["aerospace"] }
tap "siderolabs/tap", trusted: { formula: ["talosctl", "omnictl"] }

# ========================== DEVOPS & CLOUD ==========================
# Kubernetes
brew "kubernetes-cli"
brew "kubectx"
brew "helm"
brew "helmfile"
brew "k9s"
brew "cilium-cli"
brew "crane"
brew "kubelogin"
brew "kustomize"

# Azure
brew "azure-cli"

# AWS
brew "awscli"

# Flux CD
brew "fluxcd/tap/flux"

# Talos
brew "siderolabs/tap/talosctl"
brew "siderolabs/tap/omnictl"

# Terraform
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/terraform-ls"
brew "terragrunt"

# Security & Scanning
brew "trivy"

# Container Tools
cask "freelens", greedy: true

# Cloudflare
brew "cloudflared"

# ========================== SYSTEM & UTILITIES =========================
brew "direnv"
brew "stow"
brew "jq"
brew "yq"
brew "coreutils"
brew "sops"
brew "curl"
brew "wget"
brew "git"
brew "age"
brew "go-task"
brew "btop"
brew "eza"
brew "rclone"
brew "unar"
brew "gnupg"
brew "gzip"
brew "libpq"
brew "bat"

# ======================= PROGRAMMING LANGUAGES ========================
brew "rustup"
brew "golang"
brew "lua"
brew "protobuf"
brew "nvm"
brew "uv"

# ========================== APPLICATIONS ===============================
cask "1password-cli", greedy: true
cask "1password", greedy: true
brew "bitwarden-cli"
cask "pgadmin4", greedy: true
cask "tg-pro", greedy: true
cask "nikitabobko/tap/aerospace", greedy: true
cask "docker-desktop", greedy: true
cask "windows-app", greedy: true
cask "mongodb-compass", greedy: true
brew "mongosh"
cask "raycast", greedy: true
cask "slack", greedy: true
cask "claude-code", greedy: true
cask "claude", greedy: true
cask "android-studio", greedy: true
cask "android-commandlinetools", greedy: true
cask "bitwarden", greedy: true
brew "kcat"

# Editors & Terminal
brew "tmux"
brew "neovim"
cask "ghostty", greedy: true
cask "obsidian", greedy: true
cask "visual-studio-code", greedy: true
cask "zed", greedy: true

# SketchyBar
brew "sketchybar"

# ======================= ZSH PLUGINS & SHELL =======================
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# ======================== DEVELOPMENT TOOLS =========================
# Git Tools
brew "commitizen"
brew "pre-commit"
brew "glab"
brew "gh"

# Editor Tools (Neovim ecosystem)
brew "fzf"
brew "fd"
brew "ripgrep"
brew "television"
brew "lazygit"
brew "lazydocker"
brew "kubeconform"
brew "hadolint"
brew "tree-sitter-cli"

# ============================= FONTS ===============================
cask "font-hack-nerd-font", greedy: true
cask "font-jetbrains-mono-nerd-font", greedy: true
cask "font-sf-pro", greedy: true
cask "sf-symbols", greedy: true
